<template>
  <main class="main">
    <banner />

    <text-content>{{ types.text }}</text-content>
  </main>
</template>

<script>
import Banner from '@/components/banner';
import Paragraph from '@/components/paragraph';

export default {
  components: {
    banner: Banner,
    'text-content': Paragraph,
  },
  data() {
    return {
      types: {
        title: 'Виды остекления',
        text:
          'Остекление балконов и лоджий в Волгограде – довольно популярный вид работ, призванный увеличить зону комфортного проживания как в городских квартирах, так и в частных домах. В зависимости от назначения нового помещения балкона или лоджии и предъявляемым к нему требованиям осуществляется теплое остекление или холодное остекление. Варианты остекления могут быть самые разнообразные. От остекления балкона в хрущевке до панорамного остекления от пола до потолка в новостройке или коттедже. Расширение балкона с последующим остеклением также довольно частая услуга в нашем городе.',
      },
    };
  },
};
</script>

<style>
.links {
  padding-top: 15px;
}
</style>
