<template>
  <main class="main">
    <banner />
    <text-content :title="types.title" :text="types.text"></text-content>
    <numbers />
    <text-content :title="tuning.title" :text="tuning.text"></text-content>
  </main>
</template>

<script>
import Banner from '@/components/banner';
import Paragraph from '@/components/paragraph';
import Numbers from '@/components/numbers';

export default {
  components: {
    banner: Banner,
    'text-content': Paragraph,
    numbers: Numbers,
  },
  data() {
    return {
      types: {
        title: 'Типы остекления',
        text:
          'Остекление балконов и лоджий в Волгограде – довольно популярный вид работ, призванный увеличить зону комфортного проживания как в городских квартирах, так и в частных домах. В зависимости от назначения нового помещения балкона или лоджии и предъявляемым к нему требованиям осуществляется теплое остекление или холодное остекление. Варианты остекления могут быть самые разнообразные. От остекления балкона в хрущевке до панорамного остекления от пола до потолка в новостройке или коттедже. Расширение балкона с последующим остеклением также довольно частая услуга в нашем городе.',
      },
      tuning: {
        title: 'Отделка балконов и лоджий',
        text:
          'Как правило, наряду с остеклением производятся работы по наружной и внутренней отделке балкона или лоджии. Наружная отделка балкона производится для декорации парапета, а также может служить защитой от ветра и холода. Внутренняя отделка балкона или лоджии – это утепление потолка, стен, пола и парапета, а также декоративные ремонтные работы. Тут все зависит от Вашей фантазии.',
      },
      howmuch: {
        title: 'Сколько стоит застеклить балкон?',
        text:
          'Цены на остекление балконов и лоджий могут очень сильно варьироваться в зависимости от сложности работ, а также от комплектации изделий (профиль, стеклопакет и т.д.). Это может быть типовое остекление балкона, каких тысячи, а может быть сложная работа в альпинистском снаряжении. Наши специалисты всегда помогут выбрать именно тот вариант, который необходим, и оградят Вас от лишних трат.',
      },
    };
  },
};
</script>

<style>
.links {
  padding-top: 15px;
}
</style>
